УТ_для_edt/src/Documents/смартЛид/смартЛид.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартЛид</name>
  <comment>//++ #1543 смарт: Фролов 08.11.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <comment>Клиент</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПолученияЛида</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЛида</name>
    <type>
      <types>EnumRef.смартСостоянияЛидов</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.CRM_ПричиныОтклоненияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстИсточника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатыПоискаПоКИ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <comment>Тема</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегионТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Квалификация</name>
    <type>
      <types>CatalogRef.смартКвалификацииМенеджеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заметка</name>
    <type>
      <types>CatalogRef.Заметки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаСменыОтветственного</name>
    <type>
      <types>CatalogRef.смартПричиныСменыОтветственных</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущийОтветственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Распределил</name>
    <comment>//++ #1835 смарт: Фролов 28.05.2024 //Доработка рабочего места секретаря</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Yclid_Метка</name>
    <comment>//++ #1941 смарт: Фролов 22.07.2024 //Добавить реквизит &quot;yclid&quot; к Лиду и Заявкам</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ClientID</name>
    <comment>#1958 смарт: Лопато 05.08.2024 //Добавить реквизит &quot;ClientID&quot; к Лиду и Заявкам</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>JSON_ИМ_Регистрация</name>
    <comment>//++ #Б-986 смарт: Фролов 23.09.2024 //ИМ. Регистрация пользователя на сайте</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>700</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Roistat_visit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>source</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленоОповещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

УТ_для_edt/src/Enums/смартСостоянияЛидов/смартСостоянияЛидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСостоянияЛидов</name>
  <comment>//++ #1624 смарт: Фролов 14.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.</comment>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Распределен</name>
  </enumValues>
  <enumValues>
    <name>ЗавершенУспешно</name>
  </enumValues>
  <enumValues>
    <name>ЗавершенНеУспешно</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартЛид/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Пользователи.РолиДоступны("смартДобавлениеИзменениеКвалификацийМенеджеров") Тогда
		
		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Ответственный", ПараметрыСеанса.ТекущийПользователь);
		
		//++ #1624 смарт: Фролов 21.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
		ЭтаФорма.ТолькоАктуальные = Истина;
		
		Элементы.ТолькоАктуальные.Видимость = Истина;
		
		УстановитьОтборВСписке();
		//-- #1624 смарт: Фролов 21.02.2024
	Иначе
		
		МасСостояний = Новый Массив;
		
		МасСостояний.Добавить(Перечисления.смартСостоянияЛидов.Новый);
		МасСостояний.Добавить(Перечисления.смартСостоянияЛидов.Распределен);
		МасСостояний.Добавить(Перечисления.смартСостоянияЛидов.ЗавершенНеУспешно);
		МасСостояний.Добавить(Перечисления.смартСостоянияЛидов.ЗавершенУспешно);
	
		Список.Параметры.УстановитьЗначениеПараметра("МасСостояний", МасСостояний);
		
	КонецЕсли;
	
	//++ #1624 смарт: Фролов 16.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
	УстановитьУсловноеОформление();
	
	//-- #1624 смарт: Фролов 16.02.2024
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиентаНаФормеСписка(ЭтаФорма,
																		 "ДокументсмартЛид", 
																		 "Документ.смартЛид КАК ДокументсмартЛид", 
																		 "ДокументсмартЛид.Ссылка КАК Ссылка,",
																		 "Список",
																		 ,
																		 Ложь,
																		 "Партнер");
	//-- #Б3960 смарт: Шляпников 16.09.2025
	
КонецПроцедуры

&НаКлиенте
//++ #1624 смарт: Фролов 16.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Процедура ТолькоАктуальныеПриИзменении(Элемент)
	
	УстановитьОтборВСписке();
	
КонецПроцедуры //-- #1624 смарт: Фролов 16.02.2024

//++ #1624 смарт: Фролов 16.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
&НаСервере
Процедура УстановитьОтборВСписке()
	
	МасСостояний = Новый Массив;
	
	Если ЭтаФорма.ТолькоАктуальные Тогда
		МасСостояний.Добавить(Перечисления.смартСостоянияЛидов.Новый);
		МасСостояний.Добавить(Перечисления.смартСостоянияЛидов.Распределен);
	Иначе	
		МасСостояний.Добавить(Перечисления.смартСостоянияЛидов.Новый);
		МасСостояний.Добавить(Перечисления.смартСостоянияЛидов.Распределен);
		МасСостояний.Добавить(Перечисления.смартСостоянияЛидов.ЗавершенНеУспешно);
		МасСостояний.Добавить(Перечисления.смартСостоянияЛидов.ЗавершенУспешно);
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("МасСостояний", МасСостояний);
	
КонецПроцедуры	//-- #1624 смарт: Фролов 16.02.2024

#Область СлужебныеПроцедурыИФункции

//++ #1624 смарт: Фролов 21.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
&НаСервере
Процедура УстановитьУсловноеОформление() 

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ДатаОбработки");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементУсловия.Использование = Истина;
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(215, 240, 199));

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаЭлементовОтбора.Использование = Истина;

	ЭлементУсловия = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ДатаОбработки");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементУсловия.Использование = Истина;
	
	ЭлементУсловия = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ДатаКонтроля");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементУсловия.ПравоеЗначение = ТекущаяДата();
	ЭлементУсловия.Использование = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 200, 200));
	
КонецПроцедуры //-- #1624 смарт: Фролов 21.02.2024

#КонецОбласти
